Tekla.Structures.Drawing.ReinforcementBase.ReinforcementStrandAttributes
The ReinforcementStrandAttributes class is the base attributes class for
ReinforcementStrand.

Tekla.Structures.Drawing.ReinforcementBase.ReinforcementStrandAttributes.ReinforcementVisibility
Defines which bars in the group appear in drawings.

Tekla.Structures.Drawing.ReinforcementBase.ReinforcementStrandAttributes.StraightEndSymbolType
Defines how the straight ends of reinforcing bars should look like.

Tekla.Structures.Drawing.ReinforcementBase.ReinforcementStrandAttributes.HookedEndSymbolType
Defines how the hooked ends of reinforcing bars should look like.

Tekla.Structures.Drawing.ReinforcementBase.ReinforcementStrandAttributes.#ctor
Creates a new default reinforcement attributes instance that loads standard attributes.

Tekla.Structures.Drawing.ReinforcementBase.ReinforcementStrandAttributes.#ctor(System.Boolean)
Creates a new default reinforcement attributes instance that loads standard attributes.
SkipLoadingAttributes: If it set to true attributes won't be lodaded.

Tekla.Structures.Drawing.ReinforcementBase.ReinforcementStrandAttributes.#ctor(System.String)
Creates a new reinforcement attributes instance that loads the specified attributes.
AttributeFile: The filename of the attribute file.

Tekla.Structures.Drawing.ReinforcementBase.ReinforcementStrandAttributes.IsEqual(System.Object)
Compares the current object with an object of the same type.
ObjectToCompare: The object to be used for comparing.
Returns: True if all the fields (except for the database GUID) of the objects match.